### DataFrame에서 행/열 삭제

In [1]:
import pandas as pd

data={'name': ['홍길동', '마징가', '원더우먼'],
      'job': ['의적', '로봇', '영웅'],
      'gender': ['남', '남', '여'],
      'age': [100,200,300], 
      'height': [180,300,200]}

In [3]:
# DF으로 데이터 저장
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

-  실습 -> 행 삭제: 변수명.drop()메서드
    - 변수명.drop(labels, axis=0): axis의 설정 값에 따라 행 또는 열 삭제 진행
    - 변수명.drop(index): 지정된 인덱스의 행 삭제

In [4]:
dataDF.drop(1)                 #1=default->index(기본값=행 삭제,)+원본변경X
                                # axis-> 0(기본)=행, 1=열

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우먼  영웅      여  300     200

In [6]:
# 2개 행 삭제
dataDF.drop([0,2])                    #여러개도 가능(기본축(axis)->index)

  name job gender  age  height
1  마징가  로봇      남  200     300

-  실습 -> 열 삭제: 변수명.drop()메서드
    - 변수명.drop(labels, axis=1): axis의 설정 값에 따라 행 또는 열 삭제 진행
    - 변수명.drop(columns): 지정된 인덱스의 행 삭제

In [14]:
# age컬럼을 삭제
dataDF.drop('age',axis=1)

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [8]:
dataDF.drop('age', axis='columns')

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [9]:
# gender, height 칼럼 삭제
dataDF.drop(['gender', 'height'], axis=1)

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300

In [12]:
dataDF.drop(dataDF.columns[1::2],axis='columns')  #슬라이싱하려면 이름 전체에서 가져와야함

   name gender  height
0   홍길동      남     180
1   마징가      남     300
2  원더우먼      여     200

In [13]:
dataDF.drop(columns=dataDF.columns[1::2])  #column/index을 지정하면 축 지정 안해도 됨

   name gender  height
0   홍길동      남     180
1   마징가      남     300
2  원더우먼      여     200